hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Cache-Control", "no-store, no-cache, must-revalidate");
    httpd_resp_set_hdr(req, "Pragma", "no-cache");
    httpd_resp_sendstr(req, buf);
}

esp_err_t web_handle_css(httpd_req_t *req) {
    static const char *css =
        // Palette/typography matched to hiperiondev/ESP32_WSPR's embedded web admin
        ":root{--bg:#f6f7f9;--card:#ffffff;--border:#e6e8ec;--accent:#2f6fed;"
        "--green:#1a7f37;--red:#dc2626;--text:#111827;--sub:#6b7280;"
        "--shadow:0 1px 3px rgba(0,0,0,.06),0 1px 2px rgba(0,0,0,.04);"
        "--radius-card:14px;--radius-pill:999px;}"
        "*{box-sizing:border-box;margin:0;padding:0;}"
        "body{font-family:'Segoe UI',system-ui,sans-serif;background:var(--bg);color:var(--text);}"
        ".topbar{display:flex;justify-content:space-between;align-items:center;padding:14px 24px;"
        "background:var(--card);border-bottom:1px solid var(--border);box-shadow:0 1px 2px rgba(0,0,0,.03);}"
        ".topbar .brand{display:flex;align-items:center;gap:10px;font-weight:700;color:var(--text);font-size:1.05em;}"
        ".topbar .brand-mark{width:22px;height:22px;border-radius:7px;flex:none;"
        "background:linear-gradient(135deg,var(--accent),#7fb2ff);}"
        ".topbar-right{display:flex;align-items:center;gap:10px;border:1px solid var(--border);"
        "border-radius:var(--radius-pill);padding:6px 16px;background:var(--bg);}"
        ".topbar .logout{color:var(--sub);text-decoration:none;font-size:.85em;font-weight:600;}"
        ".topbar .logout:hover{color:var(--red);}"
        ".layout{display:flex;min-height:calc(100vh - 52px);}"
        ".sidebar{width:220px;background:var(--card);border-right:1px solid var(--border);"
        "box-shadow:1px 0 3px rgba(0,0,0,.03);padding:16px 0;}"
        ".sidebar ul{list-style:none;}"
        ".sidebar li a{display:block;padding:10px 18px;color:var(--text);text-decoration:none;"
        "font-size:.85em;border-left:3px solid transparent;transition:.15s;}"
        ".sidebar li a:hover{background:var(--bg);border-left-color:var(--border);}"
        ".sidebar li a.active{background:#eaf1ff;color:var(--accent);font-weight:700;border-left-color:var(--accent);}"
        ".content{flex:1;padding:24px 28px;max-width:900px;}"
        "h1{color:var(--text);font-size:1.5em;font-weight:800;margin-bottom:18px;}"
        "fieldset{background:var(--card);border:1px solid var(--border);border-radius:var(--radius-card);"
        "box-shadow:var(--shadow);margin-bottom:20px;padding:20px 22px;}"
        "legend{width:100%;color:var(--text);padding:0;margin:0 0 14px;font-size:1.05em;font-weight:700;}"
        // At-a-glance metric strip (dashboard System Info and similar live
        // stats): a row of equal cards, each with a small uppercase label and
        // a large value, matching the admin UI's stat-card look everywhere
        // it is used.
        ".stat-grid{display:flex;flex-wrap:wrap;gap:14px;}"
        ".stat-card{flex:1;min-width:150px;background:var(--card);border:1px solid var(--border);"
        "border-radius:var(--radius-card);padding:14px 16px;}"
        ".stat-label{color:var(--sub);font-size:.72em;font-weight:700;letter-spacing:.04em;"
        "text-transform:uppercase;margin-bottom:8px;}"
        ".stat-value{color:var(--text);font-size:1.4em;font-weight:800;}"
        ".stat-unit{color:var(--sub);font-size:.55em;font-weight:600;}"
        "label{display:block;color:var(--sub);font-size:.8em;margin:12px 0 4px;}"
        "label:first-child{margin-top:0;}"
        "p label{display:inline;}"
        ".pwd-show{display:block;font-size:.72em;font-weight:400;margin:4px 0 0;color:var(--sub);}"
        "input[type=text],input[type=password],input[type=number],select,textarea{"
        "width:100%;padding:8px 10px;border:1px solid var(--border);border-radius:8px;"
        "background:#fff;color:var(--text);font-size:.9em;outline:none;transition:.2s;}"
        "input:focus,select:focus,textarea:focus{border-color:var(--accent);}"
        "input[type=checkbox]{width:16px;height:16px;cursor:pointer;accent-color:var(--accent);margin-right:6px;}"
        ".row{display:flex;gap:16px;flex-wrap:wrap;}"
        ".row>div{flex:1;min-width:160px;}"
        "button,.btn{background:var(--accent);color:#fff;border:0;border-radius:8px;"
        "padding:10px 20px;font-weight:700;cursor:pointer;font-size:.9em;text-decoration:none;"
        "display:inline-block;margin-top:10px;transition:.2s;}"
        "button:hover,.btn:hover{background:#245bc4;}"
        "button.secondary,.btn.secondary{background:#eef1f5;color:var(--sub);}"
        "button.secondary:hover,.btn.secondary:hover{background:#e2e6ec;}"
        "button.danger,.btn.danger{background:#fef2f2;color:var(--red);border:1px solid var(--red);}"
        "button.danger:hover,.btn.danger:hover{background:var(--red);color:#fff;}"
        "table{border-collapse:collapse;width:100%;font-size:.82em;}"
        "table th,table td{border:1px solid var(--border);padding:7px 9px;text-align:left;}"
        "table th{background:var(--bg);color:var(--sub);}"
        ".login-box{max-width:340px;margin:80px auto;background:var(--card);padding:28px;"
        "border-radius:var(--radius-card);box-shadow:var(--shadow);border:1px solid var(--border);}"
        ".login-box h1{border:0;text-align:center;}"
        ".msg-ok{color:var(--green);} .msg-err{color:var(--red);}"
        ".badge{display:inline-block;padding:3px 10px;border-radius:var(--radius-pill);"
        "font-size:.72em;font-weight:700;letter-spacing:.02em;text-transform:uppercase;}"
        ".badge.ok{background:#d1fae5;color:var(--green);}"
        ".badge.warn{background:#fef3c7;color:#92400e;}"
        ".badge.err{background:#fee2e2;color:var(--red);}"
        ".badge.off{background:#e5e7eb;color:#4b5563;}"
        // CSS-only toggle switch: wraps the checkbox in a track+knob pair
        // driven purely by :checked, so it needs no script and keeps the
        // checkbox's own name/id/checked semantics untouched. Used only where
        // a checkbox represents a single on/off feature enable, never for a
        // multi-select checkbox list (see web_field_checkbox_plain()).
        "label.switch-row{display:flex;align-items:center;gap:10px;cursor:pointer;margin:12px 0 4px;}"
        "label.switch-row:first-child{margin-top:0;}"
        ".switch{position:relative;display:inline-block;width:40px;height:22px;flex:none;}"
        ".switch input{position:absolute;opacity:0;width:0;height:0;}"
        ".switch .slider{position:absolute;inset:0;background:#cbd5e1;border-radius:var(--radius-pill);transition:.2s;}"
        ".switch .slider::before{content:'';position:absolute;height:16px;width:16px;left:3px;top:3px;"
        "background:#fff;border-radius:50%;box-shadow:0 1px 2px rgba(0,0,0,.25);transition:.2s;}"
        ".switch input:checked+.slider{background:var(--green);}"
        ".switch input:checked+.slider::before{transform:translateX(18px);}"
        ".switch input:focus+.slider{box-shadow:0 0 0 2px rgba(47,111,237,.35);}"
        ".switch-label{color:var(--text);font-size:.85em;}"
        // Reusable light-blue callout for explanatory text under a control,
        // available for any page that wants it.
        ".info-box{background:#eef4ff;border:1px solid #cfe0fb;color:#33456b;"
        "border-radius:10px;padding:10px 14px;font-size:.82em;}"
        ".traffic-actions{display:flex;gap:8px;margin-bottom:10px;}"
        ".traffic-actions .btn{margin-top:0;padding:6px 12px;font-size:.8em;}"
        ".traffic-table-wrap{max-height:360px;overflow-y:auto;}"
        "#trafficTable td{font-family:'Consolas','Courier New',monospace;font-size:.95em;"
        "white-space:nowrap;overflow:hidden;text-overflow:ellipsis;max-width:340px;}"
        "#trafficTable th:nth-child(4),#trafficTable td:nth-child(4){max-width:420px;}"
        // Chat panel (Snd/Rcv Msg page): its height is set from the page's own
        // script, to the exact height of the last few message bubbles, so the
        // panel shows that many messages and scrolls through the rest of the
        // stored conversation. The bounds here only frame that: min-height
        // keeps the panel a readable size while the conversation is empty or
        // one line long, max-height keeps tall messages from pushing the
        // compose row off a short screen.
        ".chat-box{min-height:120px;max-height:70vh;overflow-y:auto;display:flex;flex-direction:column;"
        "gap:8px;padding:10px;background:var(--bg);border:1px solid var(--border);border-radius:8px;}"
        ".chat-empty{color:var(--sub);font-size:.85em;text-align:center;padding:20px 0;}"
        ".chat-bubble{max-width:78%;padding:8px 12px;border-radius:12px;font-size:.85em;word-break:break-word;}"
        ".chat-bubble .chat-meta{display:block;font-size:.75em;opacity:.7;margin-bottom:3px;}"
        ".chat-bubble.rx{align-self:flex-start;background:#e8e7e3;color:var(--text);border-bottom-left-radius:2px;}"
        ".chat-bubble.tx{align-self:flex-end;background:var(--accent);color:#fff;border-bottom-right-radius:2px;}"
        ".chat-bubble.tx.pending{background:#7d9be8;}"
        ".chat-compose{margin-top:14px;}"
        ".chat-compose .row{align-items:flex-start;}"
        ".chat-counter{font-size:.72em;color:var(--sub);text-align:right;margin-top:2px;}"
        "#msgChatStatus{font-size:.8em;margin-top:8px;display:block;}"
        // Per-message action row of the Winlink mailbox: the commands that act
        // on one listed message, rendered under the bubble holding that line.
        // Left-aligned like the bubble it belongs to and set in smaller
        // buttons, so a listing of several messages still reads as a listing
        // rather than as a wall of controls.
        ".wl-msg-acts{align-self:flex-start;display:flex;flex-wrap:wrap;gap:6px;margin:-4px 0 2px 4px;}"
        ".wl-msg-acts button{margin-top:0;padding:4px 10px;font-size:.75em;}"
        // Collapsible analog-channel accordion (Telemetry page): one card per
        // channel, header always visible (tag + name + live value + caret),
        // body only rendered for the currently-open channel.
        ".faint{color:var(--sub);opacity:.8;}"
        ".achan{border:1px solid var(--border);border-radius:8px;margin-bottom:10px;overflow:hidden;background:var(--bg);}"
        ".achan:last-child{margin-bottom:0;}"
        ".achan-head{display:flex;align-items:center;gap:10px;padding:11px 12px;cursor:pointer;user-select:none;min-height:40px;}"
        ".achan-head .achan-tag{font-weight:700;color:var(--accent);font-size:.9em;width:28px;flex:none;}"
        ".achan-head .achan-name{flex:1;color:var(--text);font-size:.9em;min-width:0;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;}"
        ".achan-head .achan-val{font-variant-numeric:tabular-nums;color:#92400e;font-size:.9em;min-width:70px;text-align:right;flex:none;}"
        ".achan-head .achan-caret{color:var(--sub);font-size:10px;transition:transform .15s;flex:none;}"
        ".achan.open .achan-caret{transform:rotate(90deg);}"
        ".achan-body{display:none;padding:14px;border-top:1px solid var(--border);background:var(--card);}"
        ".achan.open .achan-body{display:block;}"
        ".eqn-preview{margin-top:6px;font-size:.85em;color:var(--sub);background:var(--bg);"
        "border:1px solid var(--border);border-radius:6px;padding:6px 8px;}"
        ".eqn-preview b{color:var(--accent);}"
        "@media (max-width:420px){.achan-head{flex-wrap:wrap;row-gap:4px;}.achan-head .achan-name{flex-basis:100%;order:3;white-space:normal;}}"
        // Console log window (Logs page): a fixed-height terminal panel that
        // scrolls in both directions. Vertically because it holds more rows
        // than fit on screen, horizontally because white-space:pre keeps each
        // console line whole - a log line wrapped at the panel's width would
        // read as two entries and hide which one the timestamp belongs to.
        // The light palette matches the rest of the admin UI's cards while
        // the monospace font and pre-wrap keep a wall of log lines scannable.
        ".log-actions{display:flex;align-items:center;gap:12px;margin-bottom:10px;}"
        ".log-actions button{margin-top:0;}"
        ".log-box{height:420px;overflow:auto;margin:0;padding:10px;background:#f0f0f0;color:#111111;"
        "font-family:'Consolas','Courier New',monospace;font-size:.78em;line-height:1.35;"
        "white-space:pre;border:1px solid var(--border);border-radius:8px;}";
    httpd_resp_set_type(req, "text/css");
    return httpd_resp_sendstr(req, css);
}

// ---------------------------------------------------------------- Field helpers
void web_raw(httpd_req_t *req, const char *html) {
    httpd_resp_sendstr_chunk(req, html);
}

